FKDD_COPY_DIFF_3_2026-02-14/InformationRegisters/АСРМ_СоответствиеОбъектовУАЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>АСРМ_СоответствиеОбъектовУАЗ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.АСРМ_ВидыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.АСРМ_ВидыОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВариантПараметровПодключения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АСРМ_ВариантыПараметровПодключения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОбъектаУточнения</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.АСРМ_ВидыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектУточнения</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.АСРМ_ВидыОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Enums/ACPM_Портал.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ACPM_Портал</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>FORD</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УАЗ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/CommonModules/АСРМ_ОбщегоНазначенияСервер/Ext/Module.bsl
// Возвращает Истина, если "функциональная" подсистема существует в конфигурации.
// Предназначена для реализации вызова необязательной подсистемы (условного вызова).
//
// У "функциональной" подсистемы снят флажок "Включать в командный интерфейс".
//
// Параметры:
//  ПолноеИмяПодсистемы - Строка - полное имя объекта метаданных подсистема
//                        без слов "Подсистема." и с учетом регистра символов.
//                        Например: "СтандартныеПодсистемы.ВариантыОтчетов".
//
// Пример:
//  Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ВариантыОтчетов") Тогда
//  	МодульВариантыОтчетов = ОбщегоНазначения.ОбщийМодуль("ВариантыОтчетов");
//  	МодульВариантыОтчетов.<Имя метода>();
//  КонецЕсли;
//
// Возвращаемое значение:
//  Булево - Истина, если существует.
//
Функция ПодсистемаСуществует(ПолноеИмяПодсистемы) Экспорт
	
	ИменаПодсистем = АСРМ_ОбщегоНазначенияСерверПовтИсп.ИменаПодсистем();
	Возврат ИменаПодсистем.Получить(ПолноеИмяПодсистемы) <> Неопределено;
	
КонецФункции

// Возвращает ссылку на общий модуль по имени.
//
// Параметры:
//  Имя          - Строка - имя общего модуля, например:
//                 "ОбщегоНазначения",
//                 "ОбщегоНазначенияКлиент".
//
// Возвращаемое значение:
//  ОбщийМодуль.
//
Функция ОбщийМодуль(Имя) Экспорт
	
	Если Метаданные.ОбщиеМодули.Найти(Имя) <> Неопределено Тогда
		Модуль = Вычислить(Имя); // ВычислитьВБезопасномРежиме не требуется, т.к. проверка надежная.
	//ИначеЕсли СтрЧислоВхождений(Имя, ".") = 1 Тогда
	//	Возврат СерверныйМодульМенеджера(Имя);
	Иначе
		Модуль = Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(Модуль) <> Тип("ОбщийМодуль") Тогда
		ВызватьИсключение АСРМ_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Общий модуль ""%1"" не найден.'"), Имя);
	КонецЕсли;
	
	Возврат Модуль;
	
КонецФункции

//<<Павличенко 12.03.2020
Функция ПолучитьИдентификаторСоответствияПоОбъектуВидРемонта(ДокументЗаказНаряд) Экспорт
	//будем искать вид ремонта по идентификатору из таблицы соответствий по работам
	//91 -ТО вернет, если не найдет другого
	//29	ТО-0
	//32	ТО-1
	//35	ТО-2
	//38	ТО-3
	//41	ТО-4
	//44	ТО-5
	//47	ТО-6
	//50	ТО-7
	//53	ТО-8
	//56	ТО-9
	//59	ТО-10
	//62	ТО-11
	//65	ТО-12
	//68	ТО-13
	//71	ТО-14
	//74	ТО-15
	//77	ТО-16
	//80	ТО-17
	//83	ТО-18
	//86	ТО-19
	//89	ТО-20
	ТаблицаДанных = Новый ТаблицаЗначений();
	ТаблицаДанных.Колонки.Добавить("ID_CRM", Новый ОписаниеТипов("Число"));
	ТаблицаДанных.Колонки.Добавить("ЗначениеНомераТО");
	
	НоваяСтрока = ТаблицаДанных.Добавить();
	НоваяСтрока.ID_CRM = 29;
	НоваяСтрока.ЗначениеНомераТО = Справочники.ЗначенияСвойств.НайтиПоНаименованию("ТО-00");
	
	НоваяСтрока = ТаблицаДанных.Добавить();
	НоваяСтрока.ID_CRM = 32;
	НоваяСтрока.ЗначениеНомераТО = Справочники.ЗначенияСвойств.НайтиПоНаименованию("ТО-01");
	
	НоваяСтрока = ТаблицаДанных.Добавить();
	НоваяСтрока.ID_CRM = 35;
	НоваяСтрока.ЗначениеНомераТО = Справочники.ЗначенияСвойств.НайтиПоНаименованию("ТО-02");
	
	НоваяСтрока = ТаблицаДанных.Добавить();
	НоваяСтрока.ID_CRM = 38;
	НоваяСтрока.ЗначениеНомераТО = Справочники.ЗначенияСвойств.НайтиПоНаименованию("ТО-03");
	
	НоваяСтрока = ТаблицаДанных.Добавить();
	НоваяСтрока.ID_CRM = 41;
	НоваяСтрока.ЗначениеНомераТО = Справочники.ЗначенияСвойств.НайтиПоНаименованию("ТО-04");
	
	НоваяСтрока = ТаблицаДанных.Добавить();
	НоваяСтрока.ID_CRM = 44;
	НоваяСтрока.ЗначениеНомераТО = Справочники.ЗначенияСвойств.НайтиПоНаименованию("ТО-05");
	
	НоваяСтрока = ТаблицаДанных.Добавить();
	НоваяСтрока.ID_CRM = 47;
	НоваяСтрока.ЗначениеНомераТО = Справочники.ЗначенияСвойств.НайтиПоНаименованию("ТО-06");
	
	НоваяСтрока = ТаблицаДанных.Добавить();
	НоваяСтрока.ID_CRM = 50;
	НоваяСтрока.ЗначениеНомераТО = Справочники.ЗначенияСвойств.НайтиПоНаименованию("ТО-07");
	
	НоваяСтрока = ТаблицаДанных.Добавить();
	НоваяСтрока.ID_CRM = 53;
	НоваяСтрока.ЗначениеНомераТО = Справочники.ЗначенияСвойств.НайтиПоНаименованию("ТО-08");
	
	НоваяСтрока = ТаблицаДанных.Добавить();
	НоваяСтрока.ID_CRM = 56;
	НоваяСтрока.ЗначениеНомераТО = Справочники.ЗначенияСвойств.НайтиПоНаименованию("ТО-09");
	
	НоваяСтрока = ТаблицаДанных.Добавить();
	НоваяСтрока.ID_CRM = 59;
	НоваяСтрока.ЗначениеНомераТО = Справочники.ЗначенияСвойств.НайтиПоНаименованию("ТО-10");
	
	НоваяСтрока = ТаблицаДанных.Добавить();
	НоваяСтрока.ID_CRM = 62;
	НоваяСтрока.ЗначениеНомераТО = Справочники.ЗначенияСвойств.НайтиПоНаименованию("ТО-11");
	
	НоваяСтрока = ТаблицаДанных.Добавить();
	НоваяСтрока.ID_CRM = 65;
	НоваяСтрока.ЗначениеНомераТО = Справочники.ЗначенияСвойств.НайтиПоНаименованию("ТО-12");
	
	НоваяСтрока = ТаблицаДанных.Добавить();
	НоваяСтрока.ID_CRM = 68;
	НоваяСтрока.ЗначениеНомераТО = Справочники.ЗначенияСвойств.НайтиПоНаименованию("ТО-13");
	
	НоваяСтрока = ТаблицаДанных.Добавить();
	НоваяСтрока.ID_CRM = 71;
	НоваяСтрока.ЗначениеНомераТО = Справочники.ЗначенияСвойств.НайтиПоНаименованию("ТО-14");
	
	НоваяСтрока = ТаблицаДанных.Добавить();
	НоваяСтрока.ID_CRM = 74;
	НоваяСтрока.ЗначениеНомераТО = Справочники.ЗначенияСвойств.НайтиПоНаименованию("ТО-15");
	
	НоваяСтрока = ТаблицаДанных.Добавить();
	НоваяСтрока.ID_CRM = 77;
	НоваяСтрока.ЗначениеНомераТО = Справочники.ЗначенияСвойств.НайтиПоНаименованию("ТО-16");
	
	НоваяСтрока = ТаблицаДанных.Добавить();
	НоваяСтрока.ID_CRM = 80;
	НоваяСтрока.ЗначениеНомераТО = Справочники.ЗначенияСвойств.НайтиПоНаименованию("ТО-17");
	
	НоваяСтрока = ТаблицаДанных.Добавить();
	НоваяСтрока.ID_CRM = 83;
	НоваяСтрока.ЗначениеНомераТО = Справочники.ЗначенияСвойств.НайтиПоНаименованию("ТО-18");
	
	НоваяСтрока = ТаблицаДанных.Добавить();
	НоваяСтрока.ID_CRM = 86;
	НоваяСтрока.ЗначениеНомераТО = Справочники.ЗначенияСвойств.НайтиПоНаименованию("ТО-19");
	
	НоваяСтрока = ТаблицаДанных.Добавить();
	НоваяСтрока.ID_CRM = 89;
	НоваяСтрока.ЗначениеНомераТО = Справочники.ЗначенияСвойств.НайтиПоНаименованию("ТО-20");
	
	ИдентификаторВидаРемонта = 91;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Значение
	|ИЗ
	|	Документ.ЗаказНаряд.Работы КАК ЗаказНарядРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|		ПО ЗаказНарядРаботы.Работа = ЗначенияСвойствОбъектов.Объект
	|ГДЕ
	|	ЗаказНарядРаботы.Ссылка = &Ссылка
	|	И ЗначенияСвойствОбъектов.Свойство = &Свойство";
	Запрос.УстановитьПараметр("Ссылка", ДокументЗаказНаряд);
	Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02039"));
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда
		ЗначениеНомераТО = РезультатЗапроса.Значение;
		НайденнаяСтрока = ТаблицаДанных.Найти(ЗначениеНомераТО, "ЗначениеНомераТО");
		Если НайденнаяСтрока <> Неопределено тогда 
			ИдентификаторВидаРемонта = НайденнаяСтрока.ID_CRM;
		КонецЕсли;	
	КонецЕсли;
	Если ИдентификаторВидаРемонта = 91 тогда
		сообщить("У заказ-наряда нет авторабот с установленным номером ТО! В CRM_FORD документ будет отнесен на общий вид ремонта Техническое обслуживание, что неверно! ");
	КонецЕсли;	
	Возврат ИдентификаторВидаРемонта;

КонецФункции
//>>Павличенко 12.03.2020

Функция ПолучитьИдентификаторСоответствияПоОбъекту(Объект,ВидОбъекта,ВариантПараметровПодключения,ВидОбъектаУточнения=Неопределено,ОбъектУточнения=Неопределено,Портал) Экспорт
	Запрос = новый Запрос;
	Если Портал = Перечисления.ACPM_Портал.FORD тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	АСРМ_СоответствиеОбъектов.ВидОбъекта,
		|	АСРМ_СоответствиеОбъектов.Объект,
		|	АСРМ_СоответствиеОбъектов.Идентификатор
		|ИЗ
		|	РегистрСведений.АСРМ_СоответствиеОбъектов КАК АСРМ_СоответствиеОбъектов
		|ГДЕ
		|	АСРМ_СоответствиеОбъектов.ВидОбъекта = &ВидОбъекта
		|	И АСРМ_СоответствиеОбъектов.Объект = &Объект
		|	И АСРМ_СоответствиеОбъектов.ВидОбъектаУточнения = &ВидОбъектаУточнения
		|	И АСРМ_СоответствиеОбъектов.ОбъектУточнения = &ОбъектУточнения
		|	И АСРМ_СоответствиеОбъектов.ВариантПараметровПодключения = &ВариантПараметровПодключения";       
	ИначеЕсли Портал = Перечисления.ACPM_Портал.УАЗ тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	АСРМ_СоответствиеОбъектов.ВидОбъекта,
		|	АСРМ_СоответствиеОбъектов.Объект,
		|	АСРМ_СоответствиеОбъектов.Идентификатор
		|ИЗ
		|	РегистрСведений.АСРМ_СоответствиеОбъектовУАЗ КАК АСРМ_СоответствиеОбъектов
		|ГДЕ
		|	АСРМ_СоответствиеОбъектов.ВидОбъекта = &ВидОбъекта
		|	И АСРМ_СоответствиеОбъектов.Объект = &Объект
		|	И АСРМ_СоответствиеОбъектов.ВидОбъектаУточнения = &ВидОбъектаУточнения
		|	И АСРМ_СоответствиеОбъектов.ОбъектУточнения = &ОбъектУточнения
		|	И АСРМ_СоответствиеОбъектов.ВариантПараметровПодключения = &ВариантПараметровПодключения";       
	КонецЕсли;
	Запрос.УстановитьПараметр("Объект",Объект);
	Запрос.УстановитьПараметр("ВидОбъекта",ВидОбъекта);
	Запрос.УстановитьПараметр("ВидОбъектаУточнения",?(ВидОбъектаУточнения=Неопределено,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.ПустаяСсылка(),ВидОбъектаУточнения));
	Запрос.УстановитьПараметр("ОбъектУточнения",ОбъектУточнения);
	
	Если ТипЗнч(ВариантПараметровПодключения)=Тип("ПеречислениеСсылка.АСРМ_ВариантыПараметровПодключения") Тогда
		Запрос.УстановитьПараметр("ВариантПараметровПодключения",ВариантПараметровПодключения);
	Иначе
		Запрос.УстановитьПараметр("ВариантПараметровПодключения",Перечисления.АСРМ_ВариантыПараметровПодключения[ВариантПараметровПодключения]);
	КонецЕсли;
	
	
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.Идентификатор;
	Иначе
		Возврат "";
	КонецЕсли;
КонецФункции

Функция ПолучитьОбъектПоИдентификаторуСоответствия(Идентификатор,ВидОбъекта,ВариантПараметровПодключения,Портал) Экспорт
	Запрос = новый Запрос;
	Если Портал = Перечисления.ACPM_Портал.FORD тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	АСРМ_СоответствиеОбъектов.ВидОбъекта,
		|	АСРМ_СоответствиеОбъектов.Объект,
		|	АСРМ_СоответствиеОбъектов.Идентификатор
		|ИЗ
		|	РегистрСведений.АСРМ_СоответствиеОбъектов КАК АСРМ_СоответствиеОбъектов
		|ГДЕ
		|	АСРМ_СоответствиеОбъектов.ВидОбъекта = &ВидОбъекта
		|	И АСРМ_СоответствиеОбъектов.Идентификатор = &Идентификатор
		|	И АСРМ_СоответствиеОбъектов.ВариантПараметровПодключения = &ВариантПараметровПодключения";       
	ИначеЕсли Портал = Перечисления.ACPM_Портал.УАЗ тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	АСРМ_СоответствиеОбъектов.ВидОбъекта,
		|	АСРМ_СоответствиеОбъектов.Объект,
		|	АСРМ_СоответствиеОбъектов.Идентификатор
		|ИЗ
		|	РегистрСведений.АСРМ_СоответствиеОбъектовУАЗ КАК АСРМ_СоответствиеОбъектов
		|ГДЕ
		|	АСРМ_СоответствиеОбъектов.ВидОбъекта = &ВидОбъекта
		|	И АСРМ_СоответствиеОбъектов.Идентификатор = &Идентификатор
		|	И АСРМ_СоответствиеОбъектов.ВариантПараметровПодключения = &ВариантПараметровПодключения";       
	КонецЕсли;
	Запрос.УстановитьПараметр("Идентификатор",Идентификатор);
	Запрос.УстановитьПараметр("ВидОбъекта",ВидОбъекта);
	
	Если ТипЗнч(ВариантПараметровПодключения)=Тип("ПеречислениеСсылка.АСРМ_ВариантыПараметровПодключения") Тогда
		Запрос.УстановитьПараметр("ВариантПараметровПодключения",ВариантПараметровПодключения);
	Иначе
		Запрос.УстановитьПараметр("ВариантПараметровПодключения",Перечисления.АСРМ_ВариантыПараметровПодключения[ВариантПараметровПодключения]);
	КонецЕсли;
	
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.Объект;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

Процедура ЗаписатьСоответствиеОбъектов(Объект,ВидОбъекта,Идентификатор,ВариантПараметровПодключения,ВидОбъектаУточнения=Неопределено,ОбъектУточнения=Неопределено,Портал) Экспорт 
	Если Портал = Перечисления.ACPM_Портал.FORD тогда
		ЗаписьИдентификаторов=РегистрыСведений.АСРМ_СоответствиеОбъектов.СоздатьМенеджерЗаписи();
	ИначеЕсли Портал = Перечисления.ACPM_Портал.УАЗ тогда
		ЗаписьИдентификаторов=РегистрыСведений.АСРМ_СоответствиеОбъектовУАЗ.СоздатьМенеджерЗаписи();
	КонецЕсли;	
	ЗаписьИдентификаторов.ВидОбъекта=ВидОбъекта;
	ЗаписьИдентификаторов.Объект=Объект;
	ЗаписьИдентификаторов.Идентификатор=Идентификатор;
	ЗаписьИдентификаторов.ВидОбъектаУточнения=ВидОбъектаУточнения;
	ЗаписьИдентификаторов.ОбъектУточнения=ОбъектУточнения;
	
	Если ТипЗнч(ВариантПараметровПодключения)=Тип("ПеречислениеСсылка.АСРМ_ВариантыПараметровПодключения") Тогда
		ЗаписьИдентификаторов.ВариантПараметровПодключения=ВариантПараметровПодключения;
	Иначе
		ЗаписьИдентификаторов.ВариантПараметровПодключения=Перечисления.АСРМ_ВариантыПараметровПодключения[ВариантПараметровПодключения];
	КонецЕсли;

	
	ЗаписьИдентификаторов.Записать(Истина);
КонецПроцедуры

Функция ПолучитьТаблицуСоответствийПоВидуОбъекта(ВидОбъекта,ВариантПараметровПодключения, Портал) Экспорт
	Если Портал = Перечисления.ACPM_Портал.FORD тогда
		Запрос=Новый Запрос;
		Запрос.Текст=
		"ВЫБРАТЬ
		|	АСРМ_СоответствиеОбъектов.ВидОбъекта,
		|	АСРМ_СоответствиеОбъектов.Объект,
		|	АСРМ_СоответствиеОбъектов.Идентификатор,
		|	АСРМ_СоответствиеОбъектов.ВидОбъектаУточнения,
		|	АСРМ_СоответствиеОбъектов.ОбъектУточнения
		|ИЗ
		|	РегистрСведений.АСРМ_СоответствиеОбъектов КАК АСРМ_СоответствиеОбъектов
		|ГДЕ
		|	АСРМ_СоответствиеОбъектов.ВидОбъекта = &ВидОбъекта
		|	И АСРМ_СоответствиеОбъектов.ВариантПараметровПодключения = &ВариантПараметровПодключения";
		Запрос.УстановитьПараметр("ВидОбъекта",ВидОбъекта);
		Если ТипЗнч(ВариантПараметровПодключения)=Тип("ПеречислениеСсылка.АСРМ_ВариантыПараметровПодключения") Тогда
			Запрос.УстановитьПараметр("ВариантПараметровПодключения",ВариантПараметровПодключения);
		Иначе
			Запрос.УстановитьПараметр("ВариантПараметровПодключения",Перечисления.АСРМ_ВариантыПараметровПодключения[ВариантПараметровПодключения]);
		КонецЕсли;
		
		ТаблицаСоответствий=Запрос.Выполнить().Выгрузить();
		
		Возврат ТаблицаСоответствий;
	ИначеЕсли  Портал = Перечисления.ACPM_Портал.УАЗ тогда
		Запрос=Новый Запрос;
		Запрос.Текст=
		"ВЫБРАТЬ
		|	АСРМ_СоответствиеОбъектовУАЗ.ВидОбъекта,
		|	АСРМ_СоответствиеОбъектовУАЗ.Объект,
		|	АСРМ_СоответствиеОбъектовУАЗ.Идентификатор,
		|	АСРМ_СоответствиеОбъектовУАЗ.ВидОбъектаУточнения,
		|	АСРМ_СоответствиеОбъектовУАЗ.ОбъектУточнения
		|ИЗ
		|	РегистрСведений.АСРМ_СоответствиеОбъектовУАЗ КАК АСРМ_СоответствиеОбъектовУАЗ
		|ГДЕ
		|	АСРМ_СоответствиеОбъектовУАЗ.ВидОбъекта = &ВидОбъекта
		|	И АСРМ_СоответствиеОбъектовУАЗ.ВариантПараметровПодключения = &ВариантПараметровПодключения";
		Запрос.УстановитьПараметр("ВидОбъекта",ВидОбъекта);
		Если ТипЗнч(ВариантПараметровПодключения)=Тип("ПеречислениеСсылка.АСРМ_ВариантыПараметровПодключения") Тогда
			Запрос.УстановитьПараметр("ВариантПараметровПодключения",ВариантПараметровПодключения);
		Иначе
			Запрос.УстановитьПараметр("ВариантПараметровПодключения",Перечисления.АСРМ_ВариантыПараметровПодключения[ВариантПараметровПодключения]);
		КонецЕсли;
		
		ТаблицаСоответствий=Запрос.Выполнить().Выгрузить();
		
		Возврат ТаблицаСоответствий;

	КонецЕсли;
КонецФункции

Функция НайтиОбъектПоИдентификаторуВТаблицеСоответствий(Идентификатор,ТаблицаСоответствий) Экспорт
	НайденнаяСтрока=ТаблицаСоответствий.Найти(Идентификатор,"Идентификатор");
	Если НайденнаяСтрока=Неопределено Тогда
		Возврат 0;
	Иначе
		Возврат НайденнаяСтрока.Объект;
	КонецЕсли;
КонецФункции

Функция ПолучитьХэшТелефона(тСтрока) Экспорт
	Попытка 
		Crypt = Новый COMОбъект("System.Security.Cryptography.MD5CryptoServiceProvider");
		Text = Новый COMОбъект("System.Text.UTF8Encoding");
		
		HashArray = Crypt.ComputeHash_2(Text.GetBytes_4(тСтрока)).Выгрузить();
		
		Hash = "";
		Для Каждого Число Из HashArray Цикл
			Hash = Hash + DecToHex(Число);
		КонецЦикла;
		
		Возврат Hash;
	Исключение
	Попытка
		HashData = Новый COMОбъект("CAPICOM.HashedData"); 
		HashData.Algorithm = 3;
		HashData.Hash(тСтрока);
		Hash = HashData.Value; 
		Возврат Hash;
	Исключение
		Сообщить("Ошибка подключения к компонете CAPICOM");	
	КонецПопытки;
	КонецПопытки;
	
КонецФункции


//хэширование
Функция DecToHex(Знач Число)
	Если Число = 0 Тогда Возврат "00"; КонецЕсли; 
	_Число = Число;
	База = 16;
	Пока _Число <> 0 Цикл
		Поз =_Число % База;
		Результат = Сред("0123456789abcdef", Поз + 1, 1) + Результат;
		_Число = Цел(_Число / База);
	КонецЦикла;
	Если Число < База Тогда Результат = "0" + Результат; КонецЕсли; 
	Возврат Результат;
КонецФункции // DecToHex()
